## Análise de dados com Pandas: Reshaping de dados e Pivoting

### Victor Hugo Negrisoli - Desenvolvedor de Software Full-Stack & Analista de Dados

In [1]:
import pandas as pd
import numpy as np

#### Reshaping de dados

In [2]:
datas = pd.date_range('20200101', periods = 6)

df_datas = pd.DataFrame(np.random.randn(6, 4), index = datas, columns = ['A', 'B', 'C', 'D'])

df_datas

                   A         B         C         D
2020-01-01 -2.733156 -0.744046 -0.284381  0.495238
2020-01-02 -1.256031 -0.158019 -0.098796  2.162203
2020-01-03  0.812328  1.448921  2.871399 -1.973619
2020-01-04  0.151120  0.432934  0.415497 -0.951270
2020-01-05 -0.351490  2.096399  1.314479 -0.119817
2020-01-06  1.739260  0.045388 -1.337567  0.987493

In [3]:
df_datas.shape

(6, 4)

In [4]:
# Transpondo os dados para que as datas virem colunas

df_datas_transposto = df_datas.T
df_datas_transposto

   2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05  2020-01-06
A   -2.733156   -1.256031    0.812328    0.151120   -0.351490    1.739260
B   -0.744046   -0.158019    1.448921    0.432934    2.096399    0.045388
C   -0.284381   -0.098796    2.871399    0.415497    1.314479   -1.337567
D    0.495238    2.162203   -1.973619   -0.951270   -0.119817    0.987493

In [5]:
df_datas_transposto.shape

(4, 6)

In [6]:
valores = df_datas_transposto.values
valores

array([[-2.73315558, -1.25603144,  0.81232775,  0.15112043, -0.35149041,
         1.73926016],
       [-0.74404576, -0.15801942,  1.44892074,  0.43293393,  2.09639888,
         0.04538837],
       [-0.28438133, -0.09879615,  2.87139861,  0.41549715,  1.31447912,
        -1.33756742],
       [ 0.49523823,  2.162203  , -1.9736193 , -0.95127017, -0.11981723,
         0.98749309]])

In [7]:
# Realizando o reshaping no array numpy valores, agora teremos 12 colunas e 2 linhas

valores.reshape((2, 12))

array([[-2.73315558, -1.25603144,  0.81232775,  0.15112043, -0.35149041,
         1.73926016, -0.74404576, -0.15801942,  1.44892074,  0.43293393,
         2.09639888,  0.04538837],
       [-0.28438133, -0.09879615,  2.87139861,  0.41549715,  1.31447912,
        -1.33756742,  0.49523823,  2.162203  , -1.9736193 , -0.95127017,
        -0.11981723,  0.98749309]])

#### Pivoteamento de dados com a função pivot()

In [8]:
dias = pd.date_range('20190101', periods = 12)
dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [9]:
pessoas = ['George', 'Victor', 'Lucas']
pessoas

['George', 'Victor', 'Lucas']

In [10]:
np.random.choice(pessoas)

'Lucas'

In [11]:
nome = []
gasto = []

for i in range(12):
    nome.append(np.random.choice(pessoas))
    gasto.append(np.round(np.random.rand() * 100, 2))

In [12]:
nome

['Victor',
 'Lucas',
 'George',
 'Victor',
 'Victor',
 'George',
 'George',
 'Victor',
 'George',
 'George',
 'George',
 'Lucas']

In [13]:
gasto

[54.66,
 5.97,
 89.14,
 2.58,
 19.12,
 30.38,
 1.96,
 27.19,
 78.79,
 48.83,
 41.18,
 43.17]

In [14]:
df_nomes_gastos = pd.DataFrame({'Data': dias, 'Nome': nome, 'Gasto': gasto})
df_nomes_gastos

         Data    Nome  Gasto
0  2019-01-01  Victor  54.66
1  2019-01-02   Lucas   5.97
2  2019-01-03  George  89.14
3  2019-01-04  Victor   2.58
4  2019-01-05  Victor  19.12
5  2019-01-06  George  30.38
6  2019-01-07  George   1.96
7  2019-01-08  Victor  27.19
8  2019-01-09  George  78.79
9  2019-01-10  George  48.83
10 2019-01-11  George  41.18
11 2019-01-12   Lucas  43.17

In [15]:
# Criando um pivoteamento utilizando a função Pivot()

df_nomes_gastos.pivot(index = 'Data', columns = 'Nome', values = 'Gasto')

Nome        George  Lucas  Victor
Data
2019-01-01     NaN    NaN   54.66
2019-01-02     NaN   5.97     NaN
2019-01-03   89.14    NaN     NaN
2019-01-04     NaN    NaN    2.58
2019-01-05     NaN    NaN   19.12
2019-01-06   30.38    NaN     NaN
2019-01-07    1.96    NaN     NaN
2019-01-08     NaN    NaN   27.19
2019-01-09   78.79    NaN     NaN
2019-01-10   48.83    NaN     NaN
2019-01-11   41.18    NaN     NaN
2019-01-12     NaN  43.17     NaN

#### Criando uma tabela pivô com a função pivot_table()

In [16]:
qtd_carro_vendida = [7, 4, 3, 2, 8]
dias = pd.date_range('20190101', '20190101', periods = 5)
vendedores = ['George', 'Vagner', 'Pedro', 'Vagner', 'George']

df_venda_carros = pd.DataFrame({
    'Qtd Vendas Carros': qtd_carro_vendida,
    'Data': dias, 
    'Vendedor': vendedores
})
df_venda_carros

   Qtd Vendas Carros       Data Vendedor
0                  7 2019-01-01   George
1                  4 2019-01-01   Vagner
2                  3 2019-01-01    Pedro
3                  2 2019-01-01   Vagner
4                  8 2019-01-01   George

In [17]:
"""
 Criando a tabela pivô.

* Observação: apenas com a função pivot() não daria certo, pois a função pivot() não aceita dados repetidos, como por 
 exemplo, a nossa coluna de data

"""

pd.pivot_table(df_venda_carros, index = 'Data', columns = 'Vendedor', values = 'Qtd Vendas Carros')

Vendedor    George  Pedro  Vagner
Data
2019-01-01     7.5    3.0     3.0

In [18]:
# Utilizando a mesma tabela pivô, porém, utilizando a soma dos dados

pd.pivot_table(df_venda_carros, index = 'Data', columns = 'Vendedor', values = 'Qtd Vendas Carros', aggfunc = 'sum')

Vendedor    George  Pedro  Vagner
Data
2019-01-01      15      3       6

In [19]:
# Utilizando a mesma tabela pivô, porém, utilizando o maior dos dados

pd.pivot_table(df_venda_carros, index = 'Data', columns = 'Vendedor', values = 'Qtd Vendas Carros', aggfunc = 'max')

Vendedor    George  Pedro  Vagner
Data
2019-01-01       8      3       4

In [20]:
# Utilizando a mesma tabela pivô, porém, utilizando o menor dos dados

pd.pivot_table(df_venda_carros, index = 'Data', columns = 'Vendedor', values = 'Qtd Vendas Carros', aggfunc = 'min')

Vendedor    George  Pedro  Vagner
Data
2019-01-01       7      3       2

In [21]:
# Utilizando a mesma tabela pivô, porém, utilizando o desvio padrão entre os dados

pd.pivot_table(df_venda_carros, index = 'Data', columns = 'Vendedor', values = 'Qtd Vendas Carros', aggfunc = 'std')

Vendedor      George    Vagner
Data
2019-01-01  0.707107  1.414214

#### Stacking e Unstacking

In [23]:
# Lendo um DataFrame da rede

df_nba = pd.read_csv('https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv')
df_nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [27]:
df_nba.shape

(458, 9)

In [25]:
df_stack = df_nba.stack()
df_stack

0    Name         Avery Bradley
     Team        Boston Celtics
     Number                   0
     Position                PG
     Age                     25
                      ...
456  Age                     26
     Height                 7-0
     Weight                 231
     College             Kansas
     Salary              947276
Length: 4018, dtype: object

In [29]:
# Realizando o unstack. Volta ao DataFrame original

df_unstacked = df_stack.unstack()
df_unstacked

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,6-2,180,Texas,7.73034e+06
1,Jae Crowder,Boston Celtics,99,SF,25,6-6,235,Marquette,6.79612e+06
2,John Holland,Boston Celtics,30,SG,27,6-5,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,6-5,185,Georgia State,1.14864e+06
4,Jonas Jerebko,Boston Celtics,8,PF,29,6-10,231,NaN,5e+06
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41,PF,20,6-10,234,Kentucky,2.2398e+06
453,Shelvin Mack,Utah Jazz,8,PG,26,6-3,203,Butler,2.43333e+06
454,Raul Neto,Utah Jazz,25,PG,24,6-1,179,NaN,900000
455,Tibor Pleiss,Utah Jazz,21,C,26,7-3,256,NaN,2.9e+06
456,Jeff Withey,Utah Jazz,24,C,26,7-0,231,Kansas,947276

#### Utilizando a função Melt()

In [31]:
df_melt = pd.DataFrame({
    'A': {0: 'a', 1: 'b', 2: 'c'}, 
    'B': {0: 1, 1: 3, 2: 5},
    'C': {0: 6, 1: 4, 2: 6}
})
df_melt

   A  B  C
0  a  1  6
1  b  3  4
2  c  5  6

In [32]:
# Utilizando a função Melt() e juntando a coluna B como variável e combinando com A

pd.melt(df_melt, id_vars = ['A'], value_vars = ['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [37]:
# Utilizando a função Melt() e juntando as colunas B e C como variável e combinando com A

df_melted = pd.melt(df_melt, id_vars = ['A'], value_vars = ['B', 'C'], var_name = 'Variáveis', value_name = 'Valores')

In [45]:
data = {
    "localizacao": ["Cidade A", "Cidade B"],
    "temperatura": ["Prevista", "Atual"],
    "set-2019": [30, 32],
    "out-2019": [45, 43],
    "nov-2019": [24, 22]
}

df_data = pd.DataFrame(data, columns = ["localizacao", "temperatura", "set-2019", "out-2019", "nov-2019"])
df_data.head()

  localizacao temperatura  set-2019  out-2019  nov-2019
0    Cidade A    Prevista        30        45        24
1    Cidade B       Atual        32        43        22

In [48]:
# Combinando as colunas localizacao e temperatura e agrupando as temperaturas referentes às datas de 
# setembro, outubro e novembro de 2019

pd.melt(df_data,
        id_vars = ["localizacao", "temperatura"], 
        value_vars = ["set-2019", "out-2019", "nov-2019"],
        var_name = "Data",
        value_name = "Temperaturas"
       )

  localizacao temperatura      Data  Temperaturas
0    Cidade A    Prevista  set-2019            30
1    Cidade B       Atual  set-2019            32
2    Cidade A    Prevista  out-2019            45
3    Cidade B       Atual  out-2019            43
4    Cidade A    Prevista  nov-2019            24
5    Cidade B       Atual  nov-2019            22